Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: །སྨོན་ལམ་ཆེན་པོའི་དྲ་བ་ཐམས་ཅད་དུ་འཇུག་པའོ།
en: he is the one who caused you to enter the net of great prayers;

source: །སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ཐམས་ཅད་ལ་རབ་ཏུ་གཞོག་པའོ།
en: he is the one who has established you in the accomplishment of prayers;

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གསང་བ་ཐོས་པར་བྱེད་པའོ།
en: he is the one who caused you to hear the secrets of all the bodhisattvas;

source: །བྱང་ཆུབ་སེམས་དཔའི་བསམ་གྱིས་མི་ཁྱབ་པ་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པའོ།
en: he is the one who has taught you all the inconceivabilities of the bodhisattvas;

source: །སྔོན་གྱི་ཚེའི་གནས་སུ་སྐལ་བ་མཐུན་པར་སྤྱད་པའོ།
en: and he is the one who has practiced together with you in your past lives.

source: །རིགས་ཀྱི་བུ་དེ་བས་ན་ཁྱོད་ད་ལྟར་ཡང་འཇམ་དཔལ་གྱི་རྐང་པའི་དྲུང་ན་འདུག་གིས་ཡོན་ཏན་གྱི་གདམས་ངག་ཐམས་ཅད་ཐོབ་པར་བྱ་བ་ལ་ཡོངས་སུ་སྐྱོ་བ་མ་སྐྱེད་ཅིང་ཡོངས་སུ་སྒྱིད་ལུག་པར་མ་བྱེད་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Therefore, noble one, be again at the feet of Mañjuśrī, and do not weary or be disheartened while receiving all the instructions for the qualities. Why is that?

source: ནོར་བཟངས་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ཇི་སྙེད་ཅིག་མཐོང་བ་དང་། སྤྱོད་པའི་སྒོ་ཇི་སྙེད་ཅིག་ཐོས་པ་དང་། རྣམ་པར་ཐར་པའི་ཚུལ་ཇི་སྙེད་ཅིག་ལ་ཞུགས་པ་དང་། སྨོན་ལམ་གྱི་ཁྱད་པར་ཇི་སྙེད་ཅིག་ཁོང་དུ་ཆུད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་མཐུ་དང་བྱིན་གྱི་རླབས་སུ་བལྟ་སྟེ།
en: It is because, Sudhana, you should see that all the kalyāṇamitras that you have seen, all the gateways to conduct that you have heard, however many liberations you have engaged in, and whatever specific prayers you have been immersed in are all because of the power and blessing of Mañjuśrī Kumāra­bhūta.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་ཐམས་ཅད་ལའང་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཆོག་ཐོབ་པའོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bodhisattva mahāsattva Maitreya, circumambulated him many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the bodhisattva Maitreya. Mañjuśrī

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་བརྒྱ་རྩ་བཅུ་ཀུན་ཏུ་རྒྱུས་ཏེ། ཕྱོགས་ཀྱི་གནས་ཡིད་བདེ་བ་མངོན་དུ་འགྱུར་བ་ཞེས་བྱ་བ་ཞིག་ན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སེམས་ཤིང་རྣམ་པར་ལྟ་བས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་བ་མཐོང་བར་མོས་ཤིང་།
en: Sudhana, the head merchant’s son, after passing through a hundred and ten towns, came to the district called Sumanāmukha, where, while thinking of and looking for Mañjuśrī Kumāra­bhūta, he was aspiring and praying to see Mañjuśrī Kumāra­bhūta and continually yearning to meet him.

source: སྨོན་ལམ་ཕྲད་པར་དགའ་བས་སྡོད་ཅིང་འདུག་འདུག་པ་དང་། དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། དཔག་ཚད་བརྒྱ་རྩ་བཅུའི་ཕ་རོལ་ནས་ལག་པ་བརྐྱང་སྟེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་ཡིད་བདེ་བ་མངོན་དུ་འགྱུར་བ་ན་འདུག་པའི་སྤྱི་བོར་བཞག་སྟེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Then Mañjuśrī Kumāra­bhūta, from a distance of a hundred and ten yojanas, extended his hand and placed it upon the head of Sudhana, the head merchant’s son, who was in the town of Sumanāmukha, and said, “Well done, well done, noble one!

source: །དད་པའི་དབང་པོ་དང་མྱི་ལྡན་པ་སེམས་སྐྱོ་བ་ཅན་བསམ་པ་ཞུམ་པ་ཅན་སྦྱོར་བ་བོར་བ་བརྩོན་འགྲུས་ལྡོག་པ། ཡོན་ཏན་ཅུང་ཟད་ཀྱིས་དགའ་བར་རྩི་བ། དགེ་བའི་རྩ་བ་གཅིག་ལ་ཞེན་པར་གནས་པ། སྤྱོད་པ་དང་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ལ་མྱི་མཁས་པ་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་བཟུང་བ། སངས་རྒྱས་ཀྱིས་མ་དགོངས་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཉིད་འདི་ལྟ་བུ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་དང་ཚུལ་འདི་ལྟ་བུ་དང་། སྤྱོད་ཡུལ་འདི་ལྟ་བུ་དང་། གནས་འདི་ལྟ་བུ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་འམ། རྣམ་པར་ཤེས་པར་བྱ་བ་འམ། ཁོང་དུ་ཆུད་པར་བྱ་བ་འམ། འཇུག་པར་བྱ་བ་འམ། ཡིད་ཆེས་པར་བྱ་བ་འམ། བརྟག་པར་བྱ་བའམ། རྟོགས་པར་བྱ་བའམ།
en: Someone who does not have the power of faith, who has a mind that wearies, who has thoughts of despondency, who abandons practice, who turns away from diligence, who is pleased by having a few qualities, who remains clinging to a single root of merit, who is not skilled in accomplishing the conduct and prayer, who is not in the care of a kalyāṇamitra, and who does not consider the buddhas is unable to know the true nature of phenomena in this way, or to know this kind of way and this kind of range of activity, or to know this kind of place or enter it, or to believe in it or examine it or understand it or attain it.”

source: ཐོབ་པར་བྱ་བར་མྱི་ནུས་སོ། །ཞེས་ཏེ་དེས་དེ་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན་པ་དང་། ཡང་དག་པར་བསྐུལ་པ་དང་། གཟེངས་བསྟོད་པ་དང་དགའ་བར་བྱས་ཏེ་ཆོས་ཀྱི་སྒོ་གྲངས་མྱེད་པ་དང་། ལྡན་པར་བྱས་ནས་ཡེ་ཤེས་མཐའ་ཡས་པའི་སྣང་བ་ཆེན་པོ་ཐོབ་པར་བྱས་ཏེ།
en: Then Mañjuśrī Kumāra­bhūta taught Sudhana by speaking of the Dharma and, having inspired him, extolled him, and gladdened him, made him the possessor of countless Dharma gateways, so that he attained the great illumination of infinite wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་དང་། སྤོབས་པ་དང་ཏིང་ངེ་འཛིན་དང་། མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་མཐའ་ཡས་པའི་བྱིན་གྱིས་བྱིན་དུ་བརླབས་པར་བྱས་ཏེ། ཀུན་ཏུ་བཟང་པའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ལ་བཞག་ནས་བདག་གི་ཡུལ་ལའང་རབ་ཏུ་བཞག་སྟེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་དྲུང་ནས་སོང་ངོ་། ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ལས་སྡོང་པོས་བརྒྱན་པའི་ལེའུ་སྟེ། བཞི་བཅུ་རྩ་ལྔ་པའོ།།
en: He blessed him with a bodhisattva’s retention, eloquence, samādhi, higher cognitions, and infinite wisdom and established him in the field of completely good conduct, and he remained in his own region and departed from the presence of Sudhana, the head merchant’s son.

source: །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་ཉི་ཤུ་གཉིས་པ།
en: Samanta­bhadra and “The Prayer for Completely Good Conduct”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བསྙེན་བཀུར་བ།
en: Sudhana, the head merchant’s son, who had reverenced as many kalyāṇamitras as there are atoms in the world realms of a billion-world universe;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཚོགས་བསགས་པའི་སེམས་དང་ལྡན་པ།
en: who had the motivation to gather the accumulations for omniscience;

source: དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་ལ་མཐུན་པར་འཛིན་པས་ཞུགས་པ།
en: who correctly held and practiced the instructions and teachings of all kalyāṇamitras;

source: དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་དྲུང་དུ་བསམ་པ་མཉམ་པར་འགྲོ་བ།
en: who in the presence of all kalyāṇamitras gave rise to the same aspiration as they did;

source: དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དགའ་བར་བྱ་བས་ཡིད་མི་འབྱུང་བའི་བློ་དང་ལྡན་པ།
en: who had the realization that pleased and was not displeasing to all kalyāṇamitras;

source: དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པའི་ཚུལ་རྒྱ་མཚོའི་རྗེས་སུ་སོང་བ་སྙིང་རྗེ་ཆེན་པོའི་བསམ་པ་རྒྱ་མཚོ་ལས་ཡང་དག་པར་བྱུང་བའི་སྙིང་པོ་དང་ལྡན་པ།
en: who followed the ocean of the ways of the instructions and teachings of all kalyāṇamitras; who had the essence that arises from the ocean of the aspiration of great compassion;

source: བྱམས་པ་ཆེན་པོའི་ཚུལ་གྱི་སྤྲིན་གྱིས་འགྲོ་བ་ཐམས་ཅད་རྣམ་པར་སྣང་བར་བྱས་པ།
en: who had shone on all beings with the clouds of the ways of great love;

source: དགའ་བ་ཆེན་པོའི་ཤུགས་རྣམ་པར་འཕེལ་བའི་ལུས་དང་ལྡན་པ།
en: who had a body that increased the power of great joy;

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་ཆེན་པོ་ལ་རབ་ཏུ་ཞི་བར་རྣམ་པར་དཔྱོད་པ་སྒོ་ཐམས་ཅད་ནས་ལྷུག་པར་འཕྲོ་བའི་གཏོང་བའི་མྱིག་དང་ལྡན་པ།
en: who was active in complete peace within the vast bodhisattva liberations;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོའི་ནན་ཏན་རབ་ཏུ་རྫོགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མོས་པའི་ལམ་དུ་ཞུགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ལ་བརྩོན་འགྲུས་ཀྱི་ཤུགས་རྣམ་པར་འཕེལ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པས་ཤིན་ཏུ་སྦྱངས་པའི་བློ་དང་ལྡན་པ།
en: who had the vision focused on whatever emanates from all gateways; who had perfected the practice of the ocean of the qualities of all tathāgatas; who had followed the path of aspiration of all the tathāgatas; who had increased the power of diligence in the accumulation of omniscience; who had a mind with the perfect development of the motivation and aspiration of all bodhisattvas;

source: དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་ཞུགས་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཁོང་དུ་ཆུད་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོའི་ཚུལ་རྒྱ་མཚོའི་རྗེས་སུ་སོང་བ།
en: who had comprehended the succession of all the tathāgatas in the three times; who had realized the ocean of the ways of the Dharmas of all buddhas; who had followed the ocean of the ways of the Dharma wheels of all the tathāgatas;

source: འཇིག་རྟེན་གྱི་སྐྱེ་གནས་ཐམས་ཅད་དུ་གཟུགས་བརྙན་ཡོངས་སུ་སྟོན་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་ཚུལ་རྒྱ་མཚོ་ལ་ཞུགས་པ།
en: who had the range of activity of manifesting the appearance of taking birth in all worlds; who had comprehended the ocean of the ways of the prayers of all bodhisattvas;

source: བསྐལ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་རབ་ཏུ་ཞུགས་པ།
en: who was established in bodhisattva conduct in all kalpas;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡུལ་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: who had attained the illumination of the scope of omniscience;

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བ།
en: who had increased all the powers of a bodhisattva;

source: ཐམས་ཅད་མཁྱེན་པའི་ལམ་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: who had attained the illumination of the path to omniscience;

source: ཕྱོགས་ཐམས་ཅད་དུ་སྒྲིབ་པ་མེད་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: who had attained the unobscured illumination of all directions;

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་རབ་ཏུ་ཞུགས་པའི་བློ་དང་ལྡན་པ།
en: who had the realization that pervades the ways of the entire realm of phenomena;

source: ཞིང་གི་ཚུལ་ཐམས་ཅད་ལ་སྣང་བ་རབ་ཏུ་གྲུབ་པ་སེམས་ཅན་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་དོན་བྱ་བ་ལ་རྒྱུད་དང་མི་འཐུན་པ་མྱེད་པར་རྗེས་སུ་སོང་ངོ་།
en: who had accomplished the illumination of the ways of all realms; who had engaged in the appropriate way with the activities of the vast extent of beings;

source: །སྒྲིབ་པའི་གཡང་སའི་རི་ཐམས་ཅད་རྣམ་པར་འཐོར་བ།
en: who had demolished all the precipices and mountains of obscurations;

source: སྒྲིབ་པ་མེད་པའི་ཆོས་ཉིད་ཀྱི་རྗེས་སུ་སོང་བ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སའི་གཞི་ཀུན་ཏུ་གནས་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྙིང་པོ་ཅན་ལ་རབ་ཏུ་ཞི་བར་རྣམ་པར་དཔྱོད་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་རྗེས་སུ་ཚོལ་བ།
en: who had followed the unobscured true nature of phenomena; who was active in complete peace in the bodhisattva liberations that have the essence of all the surfaces and bases in the realm of phenomena; who was seeking the range of activity of all the tathāgatas;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་དེ།
en: who had been blessed by all the tathāgatas;

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་ཡུལ་ལ་རྣམ་པར་དཔྱོད་ཅིང་འདུག་པར་གྱུར་ཏེ།
en: who was established in being active in the range of activity of a bodhisattva; who had heard the name of the bodhisattva mahāsattva Samanta­bhadra;

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོའི་མྱིང་ཐོས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐོས་པ་དང་། སྨོན་ལམ་གྱི་ཁྱད་པར་ཐོས་པ་དང་ཚོགས་ཡོངས་སུ་བསྒྲུབ་པ་ལ་འཇུག་པ་དང་གནས་པའི་ཁྱད་པར་ཐོས་པ་དང་། མངོན་པར་བསྒྲུབ་པ་དང་འབྱུང་བའི་ལམ་གྱི་ཁྱད་པར་ཐོས་པ་དང་། ཀུན་ཏུ་བཟང་པོའི་སའི་ཚུལ་གྱི་རྒྱུད་ཐོས་པ་དང་། སའི་ཚོགས་ཐོས་པ་དང་ས་ཐོབ་པར་བྱེད་པའི་ཤུགས་ཐོས་པ་དང་ས་ཡོངས་སུ་གནོན་པ་ཐོས་པ་དང་། ས་ལ་གནས་པ་ཐོས་པ་དང་། ས་སྔོན་དུ་འདོར་བས་རྣམ་པར་གནོན་པ་ཐོས་པ་དང་། སའི་སྤྱོད་ཡུལ་ཐོས་པ་དང་། སའི་བྱིན་གྱི་རླབས་ཐོས་པ་དང་ས་ལ་ཡང་དག་པར་གནས་པ་ཐོས་ནས།
en: who had heard of his bodhisattva activity; who had heard of his special prayers; who had heard of his special entry and dwelling in the accomplishment of accumulation; who had heard of his special path of accomplishment and setting forth; who had heard of his way of activity on the completely good level; who had heard of the accumulations of his level; who had heard of his power for attaining that level; who had heard of his ascending to that level; who had heard of his being established on that level; who had heard of his reaching that level through leaving the previous levels; who had heard of the range of activity of that level; who had heard of the blessings of that level; who had heard of his dwelling on that level;

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་དགའ་ཞིང་སྐོམ་སྟེ།
en: and who yearned and thirsted for the sight of the bodhisattva Samanta­bhadra; with a motivation as vast as space that had risen above all clinging; with a perfect meditation that perceived all realms; with a mind that had transcended all attachments; with an unobscured range of activity in all phenomena; with an obstructed mind that pervaded the entire ocean of the directions; with an unobscured mind that ascended to the scope of perception of omniscience; with a pure mind that had the pure vipaśyanā that adorns a bodhimaṇḍa;

source: ནམ་མཁའི་དབྱིངས་ལྟར་ཤིན་ཏུ་ཡངས་པའི་སེམས་མངོན་པར་ཞེན་པ་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པ་དང་། ཞིང་གི་འདུ་ཤེས་ཤིན་ཏུ་བསྒོམས་པ་དང་། ཆགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་སེམས་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་སྤྱོད་ཡུལ་ཅན་དང་། ཐོགས་པ་མྱེད་པའི་སེམས་ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་དང་། སྒྲིབ་པ་མེད་པའི་སེམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡུལ་ཡོངས་སུ་གནོན་པ་དང་། ཤིན་ཏུ་རྣམ་པར་དག་པའི་སེམས་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་ལྷག་མཐོང་གིས་ཡོངས་སུ་དག་པ་དང་། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་སེམས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་རྒྱ་མཚོ་ལ་ཞུགས་པ་དང་། ཤིན་ཏུ་ཡངས་པའི་སེམས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་རྒྱས་པར་འགེངས་པ་དང་ཤིན་ཏུ་ཕྱེ་བའི་སེམས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱེད་པ་དང་། ཚད་མེད་པའི་སེམས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་གཟུགས་བརྙན་རབ་ཏུ་འབྱུང་བ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པས་མྱི་ཟད་ཅིང་མཐར་ཐུག་པ་མེད་པའི་སེམས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྟོབས་དང་མི་བསྙེངས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་མཐར་ཐུག་པས་སྙིང་པོ་བྱང་ཆུབ་རྡོ་རྗེ་དམ་པའི་སྙིང་པོ་ཅན་དེ་ལ་པད་མོའི་སྟན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ལྷུན་ཅན་ཞིག་ལ་དེ་བཞིན་གཤེགས་པའི་གདན་སེང་གེའི་ཁྲི་ལ་མངོན་པར་བལྟས་ཏེ་འདུག་གོ །དེ་ལྟར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དེ་ལྟ་བུའི་བསམ་པ་དང་ཡིད་ལ་བྱ་བ་ལ་བརྩོན་པར་གནས་པའི་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རླན་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་དང་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་སྐལ་བ་མཐུན་པས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་འགྱུར་བར་སྔོན་གྱི་ལྟས་བཅུ་བྱུང་ངོ་།
en: with a perfectly distinct mind that comprehended the ocean of the Dharmas of all the buddhas; with a vast mind that pervaded all realms of beings in order to ripen and guide them; with an immense mind that purified all buddha realms; with a measureless mind that manifested his appearance within the assemblies of the followers of all buddhas; and with an inexhaustible and endless mind that dwelled in all kalpas and had the conclusive strengths, fearlessnesses, and unique qualities of all the tathāgatas, Sudhana, in the bodhimaṇḍa, which had the supreme vajra as its essence, was seated upon a lotus seat that was a mass of all jewels, gazing at the lion throne that was the seat of the Tathāgata. Sudhana, the head merchant’s son, who was dedicated to that kind of aspiration and attention, was saturated by previous roots of merit, was blessed by the tathāgatas, and had the equivalent roots of merit in the past as the bodhisattva Samanta­bhadra, and therefore there appeared ten omens of the appearance of the bodhisattva Samanta­bhadra.

source: །བཅུ་གང་ཞེ་ན།
en: What were those ten?

source: འདི་ལྟ་སྟེ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་རྣམ་པར་དག་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: They were that (1) all buddha realms were purified through having pure adornments at the bodhimaṇḍas of all tathāgatas;

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་མི་ཁོམ་པ་དང་། ངན་སོང་དང་ངན་འགྲོའི་ལམ་ཐམས་ཅད་རྣམ་པར་བསྩལ་བས་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: all buddha realms were purified through the elimination of all their unfortunate states, lower existences, and lower realms;

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་པད་མོའི་ཚལ་གྱི་རྒྱན་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་སེམས་དགའ་ཞིང་སིམ་པར་བྱེད་པས།
en: all buddha realms were purified through becoming pure buddha realms with arrays of lotus beds; (4) all buddha realms were purified through the bodies and minds of all their beings becoming joyous and happy;

source: རྣམ་པར་དག་པར་གྱུར་ཏོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རང་བཞིན་དུ་ཀུན་ཏུ་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: all buddha realms were purified through becoming made of all precious materials;

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སེམས་ཅན་གྱི་ཁམས་ཀུན་ཏུ་མཚན་དང་དཔེ་བྱད་བཟང་པོས་རབ་ཏུ་བརྒྱན་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱན་དང་ལྷབ་ལྷུབ་ཀྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁེབས་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: all buddha realms were purified through all their realms of beings becoming adorned by the signs and features of a great being; (7) all buddha realms were purified through being covered by clouds of adornments and decorations;

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཕན་ཚུན་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་། གནོད་སེམས་མེད་པའི་སེམས་དང་ལྡན་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: all buddha realms were purified through all their beings having a nature that was mutually loving, altruistic, and without malice;

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱ་བ་ལ་བརྩོན་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏེ།
en: all buddha realms were purified through their bodhimaṇḍas becoming adorned by adornments; and (10) all buddha realms were purified through all their beings becoming dedicated to remembering and focusing on the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་འགྱུར་བའི། སྔོན་གྱི་ལྟས་བཅུ་པོ་དེ་དག་བྱུང་བར་གྱུར་ཏོ།
en: Those were the ten omens of the appearance of the bodhisattva mahāsattva Samanta­bhadra.

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་འགྱུར་བའི་སྔོན་གྱི་ལྟས་སྣང་བ་ཆེན་པོ་བཅུ་བྱུང་བར་གྱུར་ཏེ།
en: There also appeared ten lights that were omens of the appearance of the bodhisattva Samanta­bhadra.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ཞིང་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་དྲ་བ་མང་པོ་རྣམ་པར་སྣང་བར་གྱུར་ཏོ།
en: They were that (1) from each atom of the atoms of all world realms shone a multitude of nets of light rays from all tathāgatas;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་མང་པོ་འཐོན་ཏེ། ཁ་དོག་གཅིག་པ་དང་ཁ་དོག་སྣ་ཚོགས་དང་ཁ་དོག་བརྒྱ་སྟོང་དུ་མར་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ།
en: from each atom of the atoms of all world realms emerged a multitude of halos of buddhas, some of a single color, some of various colors, some with many hundreds of thousands of colors, spreading throughout the entire realm of phenomena;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྤྲིན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པར་བྱེད་པ་མང་པོ་འཐོན་ཏེ།
en: from each atom of the atoms of all world realms emerged clouds of all jewels creating the perception of the images of all tathāgatas spreading throughout the entire realm of phenomena;

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བའི་འཁོར་ལོ་དང་དཀྱིལ་འཁོར་གྱི་སྤྲིན་མང་པོ་འཐོན་ཏེ།
en: from each atom of the atoms of all world realms emerged wheels, and circles of the light radiated from all tathāgatas spreading throughout the entire realm of phenomena;

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་སྤོས་དང་། མེ་ཏོག་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་བདུག་པའི་སྤྲིན་མང་པོ་འཐོན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ཡོན་ཏན་གྱི་ཆོས་རྒྱ་མཚོའི་སྤྲིན་ཐམས་ཅད་ཀྱི་འབྲུག་སྒྲ་རབ་ཏུ་སྒྲོག་ཅིང་ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ།
en: from each atom of the atoms of all world realms emerged a multitude of clouds of perfume, flowers, garlands, ointments, and incense that resounded with thunder from all the clouds that proclaimed the ocean of the phenomena of the qualities of the bodhisattva Samanta­bhadra, spreading throughout the entire realm of phenomena;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་ཉི་མ་དང་ཟླ་བ་དང་སྐར་མའི་སྤྲིན་མང་པོ་འཐོན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་འོད་རབ་ཏུ་འགྱེད་ཅིང་།
en: from each atom of the atoms of all world realms emerged multitudes of clouds of suns, moons, and stars, emanating the light of the bodhisattva Samanta­bhadra, spreading throughout the entire realm of phenomena;

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་ལུས་ཐམས་ཅད་ཀྱི་དབྱིབས་ལྟར་འདུག་པའི་མར་མྱེའི་སྤྲིན་མང་པོ་འཐོན་ནས། སངས་རྒྱས་ཀྱི་འོད་གཟེར་ལྟར་རབ་ཏུ་སྣང་བར་བྱེད་ཅིང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ།
en: from each atom of the atoms of all world realms emerged multitudes of clouds of lamps in the shapes of all bodies, shining like the light rays of buddhas and spreading throughout the entire realm of phenomena;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་ནོར་བུ་རིན་པོ་ཆེའི་གཟུགས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུར་སྣང་བའི་སྤྲིན་མང་པོ་འཐོན་ནས། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ།
en: from each atom of the atoms of all world realms emerged multitudes of clouds of figures made of precious jewels that represent the bodies of the tathāgatas, spreading throughout all the world realms in the ten directions;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་འོད་གཟེར་གྱི་གཟུགས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུའི་དབྱིབས་སུ་སྣང་བའི་སྤྲིན་མང་པོ་འཐོན་ཏེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་དང་སྨོན་ལམ་གྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་འབེབས་ཤིང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ།
en: from each atom of the atoms of all world realms emerged multitudes of clouds of figures made of light rays that appeared in the forms of the bodies of all the tathāgatas, sending down rain from the clouds of the blessings and prayers of all the buddhas and spreading throughout the entire realm of phenomena;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གཟུགས་བརྙན་གཟུགས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱི་ཁ་དོག་དུ་སྣང་བའི་སྤྲིན་རྒྱ་མཚོ་སེམས་ཅན་ཐམས་ཅད་གདོན་པའི་སྦྱོར་བ་དང་ལྡན་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་སྒྲུབ་པ་མང་པོ་འཐོན་ཏེ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ།
en: and (10) from each atom of the atoms of all world realms emerged an ocean of clouds of the images with the appearance of all kinds of forms of the bodies of bodhisattvas, engaged in liberating all beings and accomplishing the fulfillment of the Dharma aspirations of all beings and spreading throughout the entire realm of phenomena.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་འགྱུར་བའི་སྔོན་གྱི་ལྟས་སྣང་བ་ཆེན་པོ་བཅུ་པོ་དེ་དག་བྱུང་བར་གྱུར་ཏོ།
en: Those were the ten great lights that were omens of the appearance of the bodhisattva mahāsattva Samanta­bhadra.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་སྔོན་གྱི་ལྟས་སུ་སྣང་བ་བཅུ་པོ་དེ་དག་མཐོང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་གྱུར་པའི་སྐབས་ནི་བྱེ།
en: When Sudhana, the head merchant’s son, had seen those ten great lights as omens, he gained the opportunity to see Samanta­bhadra.

source: རང་གི་དགེ་བའི་རྩ་བས་ནི་བརྟན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་ནི་བརླབས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྣང་བ་ནི་ཡང་དག་པར་སྐྱེས།
en: He had the support of his own roots of merit. He had the blessing of all the tathāgatas and had given rise to the illumination of the Dharma of all the buddhas.
